{
    "format": "layers-model",
    "generatedBy": "keras v2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.1.0",
    "modelTopology": {
        "keras_version": "2.11.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_2",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "dense_12_input"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_12",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                1
                            ],
                            "units": 10,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_13",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_14",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 500,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_15",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_16",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_17",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mean_squared_error",
            "metrics": null,
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>Adam",
                "config": {
                    "name": "Adam",
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "jit_compile": true,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0010000000474974513,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-7,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_12/kernel",
                    "shape": [
                        1,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_12/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_13/kernel",
                    "shape": [
                        10,
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_13/bias",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_14/kernel",
                    "shape": [
                        50,
                        500
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_14/bias",
                    "shape": [
                        500
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_15/kernel",
                    "shape": [
                        500,
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_15/bias",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_16/kernel",
                    "shape": [
                        50,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_16/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_17/kernel",
                    "shape": [
                        10,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_17/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}